{"Phillips,Anne": ["For the midterm, finishing seven well developed and thought out paragraphs in 65 minutes just wasn't feasible. We lost points for the paragraphs we were only able to outline although these were the instructions.", "Four short answer essays, one midterm, and one take home final. Workload is not too heavy, with readings every night. Must be prepared for discussions in class every day.", "I liked the methods of evaluation chosen.", "I loved that papers were the main form of assessment.", "I think it was good that we did papers instead of tests", "I think that there should have been more in class tests so that students would have had more of an opportunity to demonstrate all that they had learned. I think that the majority of students did not have a high enough volume of information to write papers to the standard that was expected. And I think that giving more objective assessments would have helped a lot of people grasp the material.", "I thought that the ammount of assesments were fair.", "Paper prompts were overly vague.", "This is a discussion and paper writing based class. Works for me.", "Great and varied evaluations", "I think an in class paper would have been interesting!", "We were assigned a take-home midterm (two essays in response to prompts), a presentation of a Caribbean music genre (with a partner), and we were expected to turn in two drafts of our final paper before the finals period began (for the historiography and primary source analysis). We were also sometimes asked to prepare practice theses and outlines (for critical analyses) in preparation for our final paper.", "Workload was manageable", "Almost entirely discussion.", "I enjoyed the mix and thought it worked really well. Especially considering the challenge of the classroom situation and fluctuation of the class size due to the absence of classmates traveling for sports.", "I liked the structure of the class.", "It was more of discussion than lecture which was good.", "It was mostly discussion", "It's almost all discussion, fortunately.", "The class was very discussion based and more lectures may have helped guide the discussions better.", "The discussions I felt were more opinion based.", "The structure was easy to follow.", "I liled that it was very discussion based.", "More mix -- once a week lectures would be nice to clarify some material", "This class included both lecture and discussion, but I would say the emphasis was on discussion. Professor Phillips wanted each of us to participate/share our perspectives of what we've read/watched, sometimes asking us students to formulate analyses together with group activities", "Greatly. I took this course because of all the protests that have been happening the past couple years at Dartmouth and I wanted to learn more about it.", "I learned to analyze and think critically about sources and ideas.", "I think that it really reinforced a lot of what I had already learned in my other courses.", "I want to incorporate AAAS into my major/minor.", "It made me more interested in the subject .", "It set fairly high standards", "Provided a class that I covered topics I was truly interested in and had a personal connection too.", "I most defininetly and interested in taking similar classes", "It has challenged me to improve my reading, writing, and analytical skills. It has also assured me that I am capable of doing the work for a history course, and maybe even for a AAAS minor. I am very happy that I took this class.", "It made me want to continue taking more AAAS classes"], "Booker,Vaughn": ["2 papers outlining main topics in the class and discussion posts, participation", "I like how the professor leaves writing assignments open ended because it gives students a chance to explore the topics in new ways", "I really appreciated the comprehensive feedback on papers.", "I really enjoyed the two essays we had to write for the course. I think the discussion posts that prefaced the essay writing was a great tool we were able to use to build off of for our essays to come.", "I think the papers were fair. I really appreciated the early deadline, so we did not have an assignment due during finals period. Sometimes the readings seemed to be a little much, but this was not frequently.", "I think the workload was manageable to an extent. The readings became arduous and sometimes too much when coupled with other classes. If he were to reduce some of the lengthier readings it would have been easier to keep up with the workload.", "Methods of evaluation were engaging and fair.", "Nightly readings and responses display the student's ability to read and understand the information in the material. In class discussions are centered around the readings which helped to further enlighten students' of others ideas about the readings. 2 papers are an opportunity for the students to tie all that they learned about certain parts of African American religion and culture: material, visual, or auditorial.", "The evaluation mix and expectations were fair and explained clearly. It did get difficult to maintain pace with the readings during bottlenecks in the terms (around midterms/papers and finals), but I think that is built into the course expectations and is nothing to worry about.", "We received only two grades in the class. I would suggest maybe more grades during the term.", "A take home midterm, weekly discussion posts, lots of reading, a final exam, a short paper(4-6 pages) and a final research paper 9-10 pages.", "Heavy workload - 2 exams, 2 papers and weekly reading responses", "I found the layout of tests and exams useful through the different sections using different methods of testing \n\nThe objectives of papers were well-outlined and clear of what was expected\n\nOccasionally workload of reading was difficult to manage with that of other courses, especially during larger assignments", "I think it was a heavy workload, but effective. I think everything was fair.", "Quite a bit of work, but effective.", "The final paper should be a little shorter in my opinion- I know it's a research paper but everyone has SO much going on and we do also have a test. It's a lot to give two major grade-altering assignments in the span of a week when everyone is in panic mode.", "We were expected to read many things a week which was very difficult. In addition, the essays were extremely intense.", "good mix of regular work (daily readings, weekly discussion posts) with midterms/papers (2 exams, 2 essays). definitely enough work but not overwhelming at all.", ".", "Fair", "I liked how the essay was broken down into manageable checkpoints throughout the end of the term, and the workload for this class was challenging enough.", "Fair mixture but I would make sure every student talks.", "I much prefer the discussion based learning this class allowed", "I really enjoyed the discussions, but I wish that everyone participated more.", "I think more lecture may have been beneficial in a class where many were reluctant to speak.", "I think the discussions had in the class were incredibly informative and integral to the critical engagement that took place throughout the term. However some more lecturing would have helped with clarity and context for many of the readings.", "I thought there was a good mixture.", "More discussion based while there were classes that fell closer to the lecture side.", "Most of the class was discussion which I enjoyed", "Professor Booker is intentional about achieving the right balance between lecture and discussion, with discussion-heavy classes mixed with lecturing where relevant.", "There was a good balance between lecture and discussion, and the inclusion of media sources.", "good mix between lecture and discussion", "Fair.", "Great mix between lecture and discussion", "I really liked having Friday discussion periods. I thought it was a good mix.", "I think that the amount of lecture was appropriate given the nature of the course. I also thought the lectures were not overwhelming because of the professor constantly poising questions to us and the extensive use of media.", "It was well done.", "Lecture Monday and Wednesday. Discussion Friday.", "The mix of lectures and Friday group activity worked well - the group activity allowed for further engagement of lecture materials", "pretty good, although occasionally there was just lecture and not much by way of discussion which was less fun but still fine", ".", "Great", "I loved the emphasis of discussion in this class.", "I loved taking a religion course and think I might take another next term.", "I really enjoyed the topic and I will continue to take AAAS courses.", "I think this course has made me a better writer and has taught me how to properly cite which has bee incredibly helpful. I'm truly;y grateful for this.", "I thoroughly enjoyed this class", "It did not", "It is the first religion course I have taken for my AAAS major, and I am interested in learning further how religion affects culture amongst different groups in the United States and beyond.", "It made me more confident in writing papers and I no longer will avoid classes that require papers in the term.", "This course showed me the diverse options", "This course was quite challenging and did help me jump right into my first term at Dartmouth, and I really appreciate the demand and intellectual richness of the course.", "gave me a new perspective on the religion and culture of african americans during the jim crow era", "I wish I had known about the professor sooner- I would've taken more courses.", "It made me more interested in activism.", "Learned a lot. Interested in taking more religion courses.", "N/A", "Overall I enjoyed this course and it contributed to me having a positive academic experience at Dartmouth", "This was one of my favorite classes I've taken at Dartmouth- really reminded me how much I don't know about the history of our country. I think what I've learned in this course will stay with me and will influence how I interact with the world and other future learning.", "it helped me explore more topics related to this course.", "might take more religion classes. it's my second AAAS class and I liked it, might take more of that as well.", ".", "I wish I had taken more religion classes here at Dartmouth, this class certainly was one of my most rewarding experiences."], "Favor,J Martin": [], "Glasgo,Donald": [], "Cortez Minchillo,Carlos": [], "Horowitz,Jeremy": [], "McPherson,Laura": [], "Baldez,Lisa": [], "Samin,Nadav": [], "Dorsey,James": [], "Schmidt-Hori,Sachi": [], "Levin,Theodore": [], "Craig,Sienna": [], "Kan,Sergei": [], "Ogden,Laura": [], "Thayer,Zaneta": [], "DeSilva,Jeremy": [], "Nichols,Deborah": [], "Banerjee,Dwaipayan": [], "Valentine,Benjamin": [], "Pipas,Catherine": [], "Ouajjani,El Mostafa": [], "Camerlenghi,Nicola": [], "Carroll,Jane": [], "Kassler-Taub,Elizabeth": [], "Ohnuma,Reiko": [], "Horiuchi,Yusaku": [], "Ehrlich,David": [], "Fesen,Robert": [], "Hickox,Ryan": [], "Mueller,Hans-Reinhard": [], "Witters,Lee": [], "Schaller,George": [], "Sloboda,Roger": [], "Gladfelter,Amy": [], "Bickel,Sharon": [], "Grotz,Natasha": [], "Bezanilla,Magdalena": [], "Jack,Thomas": [], "Dolph,Patrick": [], "Griffin,Erik": [], "Calsbeek,Ryan": [], "Zhaxybayeva,Olga": [], "Ayres,Matthew": [], "Cottingham,Kathryn": [], "McPeek,Mark": [], "Guerinot,Mary Lou": [], "Leib,David": [], "O'Toole,George": [], "Lutz,David": [], "Hoppa,Michael": [], "McClung,C Robertson": [], "Glueck,David": [], "Kull,F Jon": [], "Wu,Jimmy": [], "Micalizio,Glenn": [], "Christesen,Paul": [], "Hendrickson,Thomas": [], "Hruby,Julie": [], "Phillips,William": [], "Gleiser,Marcelo": [], "Loeb,Lorie": [], "Wheatley,Thalia": [], "Wegst,Ulrike": [], "Roskies,Adina": [], "van der Meer,Matthijs": [], "Granger,Richard": [], "Balkcom,Devin": [], "Dobson,James": [], "Lawrence,Amy": [], "Farid,Hany": [], "Cormen,Thomas": [], "Jayanti,Prasad": [], "Casey,Michael": [], "Bailey-Kellogg,Christopher": [], "Drysdale,Robert": [], "Hannaway,Patricia": [], "Chakrabarti,Amit": [], "Chakrabarty,Deeparnab": [], "Kotz,David": [], "Hansen,Eric": [], "Fossum,Eric": [], "Shepherd,Simon": [], "Kelly,Meredith": [], "Meyer,Edward": [], "Osterberg,Erich": [], "Strauss,Justin": [], "Hawley,Robert": [], "Renshaw,Carl": [], "Chipman,Jonathan": [], "Anderson,Patricia": [], "Novosad,Paul": [], "Fischel,William": [], "Clark,Henry": [], "Cascio,Elizabeth": [], "Schaner,Simone": [], "Lewis,Ethan": [], "Gustman,Alan": [], "Luttmer,Erzo": [], "Russell,Lauren": [], "Feyrer,James": [], "Marion,Nancy": [], "Rose,Marjorie": [], "Clifton,Eric": [], "Comin,Diego": [], "Levin,Andrew": [], "Snyder,Christopher": [], "Youle,Thomas": [], "Kohn,Meir": [], "Zinman,Jonathan": [], "Wheelan,Charles": [], "Skinner,Jonathan": [], "Venti,Steven": [], "Zitzewitz,Eric": [], "Pavcnik,Nina": [], "Passarelli,Francesco": [], "Staiger,Robert": [], "Allen,David": [], "Sacerdote,Bruce": [], "Meara,Ellen": [], "Samwick,Andrew": [], "Staiger,Douglas": [], "Coch,Donna": [], "Kraemer,David": [], "McCabe,Janice": [], "Kang,Sean": [], "Vaze,Vikrant": [], "Odame,Kofi": [], "Phan,Minh": [], "Pogue,Brian": [], "Sullivan,Charles": [], "Laser,Mark": [], "Borsuk,Mark": [], "Stauth,Jason": [], "Epps,Brenden": [], "Chen,Zi": [], "Hill,Jane": [], "Van Citters,Douglas": [], "Schweitzer,Ivy": [], "Luxon,Thomas": [], "Harner,Christie": [], "Lasky,Ronald": [], "May,Vicki": [], "Obbard,Rachel": [], "Taylor,Petra": [], "Robbie,Peter": [], "Korsunskiy,Eugene": [], "Collier,John": [], "Baker,Ian": [], "Frost,Harold": [], "Levey,Christopher": [], "Liu,Jifeng": [], "Cullen,Daniel": [], "Griswold,Karl": [], "Snyder,Scott": [], "Roisin,Benoit": [], "Hoopes,P Jack": [], "Halter,Ryan": [], "Albert,Mary": [], "Diamond,Solomon": [], "Schulson,Erland": [], "Jones,Ross": [], "Friedland,Andrew": [], "Kapuscinski,Anne": [], "Osborne,Terry": [], "Virginia,Ross": [], "Howarth,Richard": [], "Mack,Jodie": [], "Davidson,Samantha": [], "Evans,Michael": [], "Seton,Gregory": [], "Wine,J Kathleen": [], "Quaintance,Courtney": [], "Lopez,Patricia": [], "Matthes,Jaclyn": [], "Freidberg,Susanne": [], "Marchesi,Greta": [], "Wright,Richard": [], "Nelson,Garrett": [], "Miller,Eric": [], "Bafumi,Joseph": [], "Sorens,Jason": [], "Carey,John": [], "Wohlforth,William": [], "Clarke,Michelle": [], "Muirhead,James": [], "Rose,Julie": [], "Herron,Michael": [], "Nyhan,Brendan": [], "Greenhill,Brian": [], "Mastanduno,Michael": [], "Friedman,Jeffrey": [], "Bedi,Sonu": [], "Duthu,N Bruce": [], "Avishai,Bernard": [], "Benjamin,Daniel": [], "Plunkett,David": [], "Whaley,Lindsay": [], "Calloway,Colin": [], "Miller,Edward": [], "Gaposchkin,M Cecilia": [], "Simons,Walter": [], "Ericson,Steven": [], "Kremer,Richard": [], "Minardi,Anna": [], "Gilebbi,Matteo": [], "Ackerman,Susan": [], "Wright,James": [], "Bronski,Michael": [], "Reyes,Israel": [], "Evans,Zachary": [], "Gordon,Carolyn": [], "Clare,Pierre": [], "Voight,John": [], "Elizalde,Sergi": [], "Barnett,Alexander": [], "van Erp,Johannes": [], "Hanlon,Philip": [], "Shemanske,Thomas": [], "Williams,Dana": [], "Webb,David": [], "Schiavone,Samuel": [], "Ayubi,Zahra": [], "Cheng,William": [], "Campbell,John": [], "Kulvicki,John": [], "Bumpus,Ann": [], "Walden,Kenneth": [], "Lindsay,Ira": [], "Brison,Susan": [], "Ouellette,Jeremy": [], "Millan,Robyn": [], "Rimberg,Alexander": [], "LaBelle,James": [], "Whitfield,James": [], "Onofrio,Roberto": [], "Viola,Lorenza": [], "Rogers,Barrett": [], "Smith,Alexander": [], "Sellmann Soares de Oliveira,Mauricio": [], "Tse,Peter": [], "Hughes,Howard": [], "Heatherton,Todd": [], "Duchaine,Bradley": [], "Hull,Jay": [], "Shim,Won Mok": [], "Wolford,George": [], "Cooper,Emily": [], "Funnell,Margaret": [], "Santulli,Robert": [], "Singh,Devin": [], "Benor,Ehud": [], "Ferrara,Thomas": [], "Dixon,Marc": [], "Parsa,Misagh": [], "Bascunan,Carmen": [], "Ingham,Veronica": [], "Compton,Joshua": [], "Klaas,Paul": [], "Drummond,Darlene": [], "Rice,James": [], "Kotlowitz,Daniel": [], "Munafo,Giavanna": [], "Lim,Eng-Beng": [], "Sargent,Jennifer": [], "Monroe,Cynthia": []}